:PREAMBLE:
#+title: Epkgs: Melpa
#+setupfile: .orgconfig
#+name: setup
#+begin_src emacs-lisp :results silent
  (require 'emir)
#+end_src
#+name: addheader
#+header: :var header="" :var rows=""
#+begin_src elisp :hlines yes :results none
  (epkg-add-org-header rows header)
#+end_src
[[https://emacsmirror.net/stats][up]]
:END:
* Missing from Melpa
:PROPERTIES:
:ID:       7d6ef98f-8f71-4f28-8e89-532d5b48d61a
:END:

The below packages, which are available from the Emacsmirror, are
missing from Melpa.  Not all of those packages should be added to
Melpa (in fact most of them shouldn't), and if you decide to submit
recipes for some of them, then please first make sure they meet the
minimal requirements.

Also see https://github.com/melpa/melpa/issues/7892.

** Github
:PROPERTIES:
:ID:       6a667542-10c1-4c12-a4f3-839be669c2f2
:END:
#+name: missing-github
#+begin_src emacs-lisp :post addheader('(1 "Package" "Link" "Summary"),*this*)
  ;; (cl-sort
  (seq-keep (pcase-lambda (`(,name ,summary))
              (and (not (epkg-get-recipe 'melpa name))
                   (not (epkg-get-recipe 'gnu name))
                   (not (epkg-get-recipe 'nongnu name))
                   (list name
                         ;; (with-emir-repository (epkg name)
                         ;;   (magit-git-string
                         ;;    "log" "-1" "--format=%cd" "--date=short"))
                         ;; (and (member name emir--archived-packages) t)
                         (epkg-org-link name)
                         (and summary (truncate-string-to-width
                                       (string-replace "|" ";" summary) 70)))))
            (epkgs [name summary] [github]))
  ;; #'string> :key #'cadr)
#+end_src
#+results: missing-github
| Package (552)                | Link                                    | Summary                                                                |
|------------------------------+-----------------------------------------+------------------------------------------------------------------------|
| header-file                  | [[https://github.com/0x4b/header-file-mode][0x4b/header-file-mode]]                   | Assign a major mode for header files                                   |
| snort-mode                   | [[https://github.com/BobuSumisu/snort-mode][BobuSumisu/snort-mode]]                   | Major mode for editing Snort rules                                     |
| todostack                    | [[https://github.com/EvansWinner/todostack.el][EvansWinner/todostack.el]]                | Keep a to-do list as a simple stack                                    |
| org-bom                      | [[https://github.com/Frozenlock/Org-Bill-of-materials][Frozenlock/Org-Bill-of-materials]]        | Collect components across the entire org buffer                        |
| better-jump                  | [[https://github.com/Fuco1/better-jump][Fuco1/better-jump]]                       | Execute actions at places                                              |
| dired-hacks                  | [[https://github.com/Fuco1/dired-hacks][Fuco1/dired-hacks]]                       | Collection of useful dired additions                                   |
| keyadvice                    | [[https://github.com/Fuco1/keyadvice.el][Fuco1/keyadvice.el]]                      | Advice keybindings to run additional user defined code                 |
| sallet                       | [[https://github.com/Fuco1/sallet][Fuco1/sallet]]                            | Select candidates in a buffer                                          |
| slime-js                     | [[https://github.com/Gozala/slime-js][Gozala/slime-js]]                         | Slime extension for swank-js                                           |
| diatheke                     | [[https://github.com/JasonFruit/diatheke.el][JasonFruit/diatheke.el]]                  | A minor mode using the diatheke command-line Bible tool                |
| font-lock-regression-suite   | [[https://github.com/Lindydancer/font-lock-regression-suite][Lindydancer/font-lock-regression-suite]]  | Test suite for font-lock                                               |
| company-ess                  | [[https://github.com/Lompik/company-ess][Lompik/company-ess]]                      | R/ess Completion Backend for company-mode                              |
| org-defprop                  | [[https://github.com/Neil-Smithline/org-defprop][Neil-Smithline/org-defprop]]              | Define Org Mode variables and settings with a corresponding #+KEYWORDS |
| org-global-insert-link       | [[https://github.com/Neil-Smithline/org-global-insert-link][Neil-Smithline/org-global-insert-link]]   | Use Org Mode's ability to capture links in other modes                 |
| nyan-prompt                  | [[https://github.com/PuercoPop/nyan-prompt][PuercoPop/nyan-prompt]]                   | Nyan Cat on the eshell prompt                                          |
| org-extra-emphasis           | [[https://github.com/QiangF/org-extra-emphasis][QiangF/org-extra-emphasis]]               | Extra Emphasis markers for Org                                         |
| popup-frame                  | [[https://github.com/Sarcasm/popup-frame][Sarcasm/popup-frame]]                     | Popup frame management                                                 |
| posn-on-screen               | [[https://github.com/Sarcasm/posn-on-screen][Sarcasm/posn-on-screen]]                  | Find the coordinates (x, y) around point on screen                     |
| json-sexp-mode               | [[https://github.com/TaylanUB/json-sexp-mode][TaylanUB/json-sexp-mode]]                 | Edit JSON in s-expression form                                         |
| doxygen                      | [[https://github.com/TreeRex/doxygen-el][TreeRex/doxygen-el]]                      | Support for doxygen style comments                                     |
| cycle-buffer                 | [[https://github.com/VladimirAlexiev/emacs-cycle-buffer][VladimirAlexiev/emacs-cycle-buffer]]      | Select buffer by cycling through                                       |
| python-info                  | [[https://github.com/Wilfred/python-info][Wilfred/python-info]]                     | Python info manual for Emacs                                           |
| org-reading                  | [[https://github.com/abhiyerra/org-reading][abhiyerra/org-reading]]                   | Manage your reading with org-mode                                      |
| abel                         | [[https://github.com/abo-abo/abel][abo-abo/abel]]                            | Abbrevs for Elisp                                                      |
| cc-chainsaw                  | [[https://github.com/abo-abo/cc-chainsaw][abo-abo/cc-chainsaw]]                     | A few tricks to make c++-mode go                                       |
| eltex                        | [[https://github.com/abo-abo/eltex][abo-abo/eltex]]                           | Write LaTeX in Emacs Lisp                                              |
| latex-wrap                   | [[https://github.com/abo-abo/latex-wrap][abo-abo/latex-wrap]]                      | Wrap selection with a LaTeX environment                                |
| noprefix                     | [[https://github.com/abo-abo/noprefix][abo-abo/noprefix]]                        | Strip/dress namespace prefix from Elisp package                        |
| window-margin                | [[https://github.com/aculich/window-margin.el][aculich/window-margin.el]]                | Automatic margins for visual-line-mode wrapping                        |
| helm-mu-contacts             | [[https://github.com/agpchil/helm-mu-contacts][agpchil/helm-mu-contacts]]                | Mu contacts source for helm                                            |
| code-imports                 | [[https://github.com/ahyatt/code-imports][ahyatt/code-imports]]                     | A module for organizing and adding to code imports                     |
| lazarus                      | [[https://github.com/ajvargo/Lazarus][ajvargo/Lazarus]]                         | Open recently closed files                                             |
| e2wm-perspb                  | [[https://github.com/aki2o/e2wm-perspb][aki2o/e2wm-perspb]]                       | Plugin of e2wm.el for buffer list of persp-mode.el                     |
| tenv                         | [[https://github.com/aki2o/elisp-test][aki2o/elisp-test]]                        | Provide functions for test environment building                        |
| one-key-local                | [[https://github.com/aki2o/one-key-local][aki2o/one-key-local]]                     | Create menu of one-key.el for any major-mode or minor-mode             |
| yaol                         | [[https://github.com/aki2o/yaol-el][aki2o/yaol-el]]                           | Yet another outline                                                    |
| ecd                          | [[https://github.com/akicho8/ecd][akicho8/ecd]]                             | Easy Change Directory                                                  |
| text-align                   | [[https://github.com/akicho8/text-align][akicho8/text-align]]                      | スペースを削除してカラムを揃える                                       |
| acme-mouse                   | [[https://github.com/akrito/acme-mouse][akrito/acme-mouse]]                       | Mouse-button chording                                                  |
| diff-git                     | [[https://github.com/alanfalloon/diff-git.el][alanfalloon/diff-git.el]]                 | Git integration with diff-mode                                         |
| org-passwords                | [[https://github.com/alfaromurillo/org-passwords.el][alfaromurillo/org-passwords.el]]          | Org derived mode for managing passwords                                |
| org-daypage                  | [[https://github.com/almost/org-daypage][almost/org-daypage]]                      | Org-Mode Day Page                                                      |
| frame-bufs                   | [[https://github.com/alpaker/frame-bufs][alpaker/frame-bufs]]                      | A minor mode for frame-relative buffer lists                           |
| makem                        | [[https://github.com/alphapapa/makem.sh][alphapapa/makem.sh]]                      | Tools for using makem.sh in Emacs                                      |
| erc-highlight-nicknames      | [[https://github.com/amalloy/erc-highlight-nick][amalloy/erc-highlight-nick]]              | Highlights nicknames                                                   |
| activator                    | [[https://github.com/apg/activator-el][apg/activator-el]]                        | An init.d style config manager                                         |
| kibit-mode                   | [[https://github.com/aredington/kibit-mode][aredington/kibit-mode]]                   | Enhance clojure-mode with Kibit analysis                               |
| consult-gh                   | [[https://github.com/armindarvish/consult-gh][armindarvish/consult-gh]]                 | Consulting GitHub Client                                               |
| flymake-csslint              | [[https://github.com/arnested/flymake-csslint][arnested/flymake-csslint]]                | Making flymake work with CSSLint                                       |
| autocompletion-php-functions | [[https://github.com/ashizawa/autocompletion-php-functions][ashizawa/autocompletion-php-functions]]   | Auto complete php functions                                            |
| html-fold                    | [[https://github.com/ataka/html-fold][ataka/html-fold]]                         | Fold HTML elements                                                     |
| epom                         | [[https://github.com/aufrank/epom][aufrank/epom]]                            | Pomodoro time management in emacs                                      |
| skeleton-complete            | [[https://github.com/baohaojun/skeleton-complete][baohaojun/skeleton-complete]]             | Dynamically expand expressions by provided skeleton (flex matching)    |
| mailcrypt                    | [[https://github.com/barak/mailcrypt][barak/mailcrypt]]                         | Mail encryption with PGP                                               |
| velocity                     | [[https://github.com/bard/emacs-velocity][bard/emacs-velocity]]                     | Search, browse, create text in multiple formats                        |
| nazna                        | [[https://github.com/baron/nazna.el][baron/nazna.el]]                          | Mental arithmetic for emacs                                            |
| binmove                      | [[https://github.com/beketa/binmove][beketa/binmove]]                          | Minor mode to move cursor up / down like binary search                 |
| screensend                   | [[https://github.com/benwbooth/screensend.el][benwbooth/screensend.el]]                 | Send blocks of text from emacs to screen or tmux sessions              |
| speechd                      | [[https://github.com/brailcom/speechd-el][brailcom/speechd-el]]                     | Library for accessing Speech Dispatcher                                |
| octopress-tentacle           | [[https://github.com/brighid/octopress-tentacle][brighid/octopress-tentacle]]              | Tools for Octopress/Jekyll blogs                                       |
| im-notification              | [[https://github.com/bvtrach/emacs-im-notification][bvtrach/emacs-im-notification]]           | Emacs input method notification via D-Bus                              |
| monorepo-cadadr              | [[https://github.com/cadadr/elisp][cadadr/elisp]]                            | A monorepo containing unrelated packages                               |
| ecco                         | [[https://github.com/capitaomorte/ecco][joaotavora/ecco]]                         | A port of docco                                                        |
| edice                        | [[https://github.com/capitaomorte/edice][joaotavora/edice]]                        | Really, why would you want to roll dice in Emacs?                      |
| ebm                          | [[https://github.com/carrl/ebm][carrl/ebm]]                               | Emacs Bookmarks                                                        |
| exim                         | [[https://github.com/ch11ng/exim][ch11ng/exim]]                             | Emacs X Input Method                                                   |
| backups-mode                 | [[https://github.com/chadbraunduin/backups-mode][chadbraunduin/backups-mode]]              | Major mode for autosaving files and listing, viewing, and reverting Em |
| css-format                   | [[https://github.com/chalmagean/css-format.el][chalmagean/css-format.el]]                | Toggle CSS inline/multiline block format                               |
| current-story                | [[https://github.com/charlietanksley/current-story][charlietanksley/current-story]]           | Track and insert current Pivotal Tracker                               |
| dictem                       | [[https://github.com/cheusov/dictem][cheusov/dictem]]                          | DICT protocol client (rfc-2229) for [X]Emacs                           |
| gitsum                       | [[https://github.com/chneukirchen/gitsum][leahneukirchen/gitsum]]                   | Basic darcsum feelalike for Git                                        |
| twiki                        | [[https://github.com/christopherjwhite/emacs-twiki-mode][christopherjwhite/emacs-twiki-mode]]      | Mode for editing Twiki wiki files for emacs                            |
| curl                         | [[https://github.com/cinsk/emacs-curl][cinsk/emacs-curl]]                        | CURL binding for elisp                                                 |
| sofa                         | [[https://github.com/cinsk/emacs-sofa][cinsk/emacs-sofa]]                        | CouchDB console (like Futon)                                           |
| vim-modeline                 | [[https://github.com/cinsk/emacs-vim-modeline][cinsk/emacs-vim-modeline]]                | Vim modeline support                                                   |
| revealjs-mode                | [[https://github.com/cjohansen/revealjs-mode][cjohansen/revealjs-mode]]                 | Minor mode to navigate and edit HTML files                             |
| clasker                      | [[https://github.com/clasker/clasker][clasker/clasker]]                         | An experimental tracker for Emacs                                      |
| ical2org                     | [[https://github.com/cofi/ical2org][cofi/ical2org]]                           | Convert icalendar to org                                               |
| evil-elscreen                | [[https://github.com/coldnew/evil-elscreen][coldnew/evil-elscreen]]                   | Evil wrpaaer to use elscreen as tab                                    |
| linum-ace                    | [[https://github.com/coldnew/linum-ace][coldnew/linum-ace]]                       | Display line number as character like ace-jump-line-mode               |
| stack-mode                   | [[https://github.com/commercialhaskell/stack-ide][commercialhaskell/stack-ide]]             | A minor mode enabling various features based on stack-ide              |
| bing-api                     | [[https://github.com/coordinate/bingapiel][coordinate/bingapiel]]                    | Use bing api                                                           |
| copilot                      | [[https://github.com/copilot-emacs/copilot.el][copilot-emacs/copilot.el]]                | An unofficial Copilot plugin for Emacs                                 |
| eimap                        | [[https://github.com/corecode/eimap][corecode/eimap]]                          | Imap processing using a streaming data model                           |
| emacs-android                | [[https://github.com/cpc26/emacs-android][cpc26/emacs-android]]                     | Android Development with GNU/Emacs                                     |
| worklog                      | [[https://github.com/credmp/worklog][credmp/worklog]]                          | The Emacs timetracker                                                  |
| songbook                     | [[https://github.com/crep4ever/songbook-emacs-mode][crep4ever/songbook-emacs-mode]]           | Major mode for editing the song files of Patacrep songbook             |
| esv                          | [[https://github.com/csebold/esv.el][csebold/esv.el]]                          | Support for Crossway's ESV API in Emacs                                |
| mandoku-meta-kr              | [[https://github.com/cwittern/KR][cwittern/KR]]                             | Metadata for the KR repository to be used by Mandoku                   |
| trindle                      | [[https://github.com/daic-h/trindle][daichirata/trindle]]                      | Simple Emacs LISP management extension                                 |
| highlight-sexp               | [[https://github.com/daimrod/highlight-sexp][daimrod/highlight-sexp]]                  | Highlight current zone according to its context                        |
| perlbrew-mini                | [[https://github.com/dams/perlbrew-mini.el][dams/perlbrew-mini.el]]                   | A simple perlbrew wrapper for Emacs                                    |
| makefile-runner              | [[https://github.com/danamlund/emacs-makefile-runner][danamlund/emacs-makefile-runner]]         | Searches for Makefile and fetches targets                              |
| minimal                      | [[https://github.com/dandavison/minimal][dandavison/minimal]]                      | Minimalist Emacs appearance                                            |
| org-buffers                  | [[https://github.com/dandavison/org-buffers][dandavison/org-buffers]]                  | An Org-mode tool for buffer management                                 |
| paredit-c                    | [[https://github.com/dandavison/paredit-c][dandavison/paredit-c]]                    | Paredit mode for C-style languages                                     |
| evimodeline                  | [[https://github.com/danderson/evimodeline][danderson/evimodeline]]                   | Vim modeline support                                                   |
| fzf-native                   | [[https://github.com/dangduc/fzf-native][dangduc/fzf-native]]                      | Fuzzy completion style                                                 |
| wordpress-mode               | [[https://github.com/danlamanna/wordpress-mode][danlamanna/wordpress-mode]]               | A minor mode for speeding up WordPress development in emacs            |
| theme-park-mode              | [[https://github.com/darrik/theme-park-mode][darrik/theme-park-mode]]                  | Take your themes for a ride!                                           |
| avmmf                        | [[https://github.com/davep/avmmf.el][davep/avmmf.el]]                          | AVM Microformat tools for emacs                                        |
| constellations               | [[https://github.com/davep/constellations.el][davep/constellations.el]]                 | Constellation tools                                                    |
| festival                     | [[https://github.com/davep/festival.el][davep/festival.el]]                       | Emacs interface into festival                                          |
| fscroll                      | [[https://github.com/davep/fscroll.el][davep/fscroll.el]]                        | Make scroll-{up,down} go all the way                                   |
| icmp-info                    | [[https://github.com/davep/icmp-info.el][davep/icmp-info.el]]                      | ICMP information tool                                                  |
| ngn                          | [[https://github.com/davep/ngn.el][davep/ngn.el]]                            | Quickly insert a newsgroup name                                        |
| nukneval                     | [[https://github.com/davep/nukneval.el][davep/nukneval.el]]                       | Nuke and reevaluate an elisp buffer                                    |
| smartsig                     | [[https://github.com/davep/smartsig.el][davep/smartsig.el]]                       | Smart signature selection based on message content                     |
| unbind                       | [[https://github.com/davep/unbind.el][davep/unbind.el]]                         | Commands for unbinding things                                          |
| aml-mode                     | [[https://github.com/david-christiansen/aml-mode][david-christiansen/aml-mode]]             | An Emacs major mode for AML                                            |
| come-fly                     | [[https://github.com/davidmiller/come-fly][davidmiller/come-fly]]                    | Minor mode for the Sinatra web mini-framework                          |
| fab                          | [[https://github.com/davidmiller/fabmacs][davidmiller/fabmacs]]                     | Fabric integration for Emacs                                           |
| thrift-mode                  | [[https://github.com/davidmiller/thrift-mode][davidmiller/thrift-mode]]                 | Major mode for editing Thrift definition files                         |
| sbt                          | [[https://github.com/dchenbecker/sbt.el][dchenbecker/sbt.el]]                      | Support for running sbt in inferior mode                               |
| slate-config-mode            | [[https://github.com/ddjfreedom/slate-config-mode][ddjfreedom/slate-config-mode]]            | A major mode to edit .slate file to config Slate window manager        |
| auto-pep8                    | [[https://github.com/deactivated/auto-pep8.el][deactivated/auto-pep8.el]]                | Minor mode to automatically run pep8 on save                           |
| dedent                       | [[https://github.com/deactivated/dedent-el][deactivated/dedent-el]]                   | Add and remove indentation during copy and paste                       |
| edit-thing                   | [[https://github.com/deactivated/edit-thing-el][deactivated/edit-thing-el]]               | Narrow-to-region on steroids                                           |
| hl-tags-mode                 | [[https://github.com/deactivated/hl-tags-mode][deactivated/hl-tags-mode]]                | Highlight the current SGML tag context                                 |
| reddit-mode                  | [[https://github.com/death/reddit-mode][death/reddit-mode]]                       | Support for the Reddit time sink                                       |
| showoff-mode                 | [[https://github.com/developernotes/showoff-mode][developernotes/showoff-mode]]             | Major mode to edit showoff presentation files in Emacs                 |
| rcfiles                      | [[https://github.com/didierverna/el-rcfiles][didierverna/el-rcfiles]]                  | Unix-like rc files for Emacs Lisp libraries                            |
| wipe                         | [[https://github.com/didierverna/wipe][didierverna/wipe]]                        | Whitespace Inspection and Pruning for Emacs                            |
| multi-column-mode            | [[https://github.com/diiq/multi-column-mode][diiq/multi-column-mode]]                  | Multi-column editing                                                   |
| mailq                        | [[https://github.com/dimitri/mailq-el][dimitri/mailq-el]]                        | A major mode for `mailq' interaction                                   |
| pgsql-linum-format           | [[https://github.com/dimitri/pgsql-linum-format][dimitri/pgsql-linum-format]]              | Dimitri Fontaine                                                       |
| pgsrc                        | [[https://github.com/dimitri/pgsrc-el][dimitri/pgsrc-el]]                        | Source Code Editing Facilities for PostgreSQL                          |
| mu4e                         | [[https://github.com/djcb/mu][djcb/mu]]                                 | Mu4e, the mu mail user agent                                           |
| org-manage                   | [[https://github.com/dmgerman/org-manage][dmgerman/org-manage]]                     | Manage org files in a given directory                                  |
| masquerade-mode              | [[https://github.com/dsevilla/masquerade-mode-el][dsevilla/masquerade-mode-el]]             | Minor mode to add templating capabilities to any mode                  |
| gplus-mode                   | [[https://github.com/ellencubed/gplus-mode][ellencubed/gplus-mode]]                   | Major mode for Google Plus                                             |
| eaf-airshare                 | [[https://github.com/emacs-eaf/eaf-airshare][emacs-eaf/eaf-airshare]]                  | Airshare plugins                                                       |
| eaf-browser                  | [[https://github.com/emacs-eaf/eaf-browser][emacs-eaf/eaf-browser]]                   | Browser plugins                                                        |
| eaf-file-manager             | [[https://github.com/emacs-eaf/eaf-file-manager][emacs-eaf/eaf-file-manager]]              | File manager                                                           |
| eaf-pdf-viewer               | [[https://github.com/emacs-eaf/eaf-pdf-viewer][emacs-eaf/eaf-pdf-viewer]]                | PDF Viewer                                                             |
| eaf-terminal                 | [[https://github.com/emacs-eaf/eaf-terminal][emacs-eaf/eaf-terminal]]                  | Terminal plugins                                                       |
| eaf-video-player             | [[https://github.com/emacs-eaf/eaf-video-player][emacs-eaf/eaf-video-player]]              | Video player                                                           |
| eaf                          | [[https://github.com/emacs-eaf/emacs-application-framework][emacs-eaf/emacs-application-framework]]   | Emacs application framework                                            |
| ess-stata-mode               | [[https://github.com/emacs-ess/ess-stata-mode][emacs-ess/ess-stata-mode]]                | Stata customization                                                    |
| ajc-java-complete            | [[https://github.com/emacs-java/auto-java-complete][emacs-java/auto-java-complete]]           | Auto Java Completion for GNU Emacs                                     |
| emir                         | [[https://github.com/emacscollective/emir][emacscollective/emir]]                    | Maintain the Emacsmirror                                               |
| sinasi                       | [[https://github.com/emk/sinasi][emk/sinasi]]                              | Sinasi Is Not A SproutCore IDE                                         |
| test-framework               | [[https://github.com/epsil/test-framework.el][epsil/test-framework.el]]                 | Framework for unit testing                                             |
| sunrise-commander            | [[https://github.com/escherdragon/sunrise-commander][escherdragon/sunrise-commander]]          | Two-pane file manager for Emacs based on Dired and inspired by MC      |
| rustfmt                      | [[https://github.com/fbergroth/emacs-rustfmt][fbergroth/emacs-rustfmt]]                 | Format rust code using rustfmt                                         |
| lyricwiki                    | [[https://github.com/febuiles/lyricwiki.el][febuiles/lyricwiki.el]]                   | An Emacs mode to fetch lyrics                                          |
| a2ps-multibyte               | [[https://github.com/ffevotte/a2ps-multibyte.el][ffevotte/a2ps-multibyte.el]]              | Print buffers with a2ps even when they are encoded in utf-8            |
| projutils                    | [[https://github.com/fgallina/projutils.el][fgallina/projutils.el]]                   | Project utils                                                          |
| startupd                     | [[https://github.com/fgallina/startupd.el][fgallina/startupd.el]]                    | Modular loading of Emacs configuration                                 |
| atom                         | [[https://github.com/fperrin/atom][fperrin/atom]]                            | Create an Atom feed                                                    |
| powershell-mode              | [[https://github.com/fperrin/powershell-mode][fperrin/powershell-mode]]                 | Mode for editing Powershell scripts                                    |
| vc-partial-commit            | [[https://github.com/fperrin/vc-partial-commit][fperrin/vc-partial-commit]]               | Commit only some changes from a diff                                   |
| recaptcha                    | [[https://github.com/fsmunoz/recaptcha][fsmunoz/recaptcha]]                       | An Emacs Lisp interface to reCAPTCHA                                   |
| wmii                         | [[https://github.com/fsmunoz/wmii-el][fsmunoz/wmii-el]]                         | Elisp controller for the wmii window-manager                           |
| kindly-mode                  | [[https://github.com/fukamachi/kindly-mode][fukamachi/kindly-mode]]                   | Amazon Kindle-like view mode                                           |
| textsnip                     | [[https://github.com/functionreturnfunction/textsnip.el][functionreturnfunction/textsnip.el]]      | Posts text to textsnip for sharing                                     |
| expectations-mode            | [[https://github.com/gar3thjon3s/expectations-mode][clojure-expectations/expectations-mode]]  | Minor mode for expectations tests                                      |
| smart-quotes                 | [[https://github.com/gareth-rees/smart-quotes][gareth-rees/smart-quotes]]                | Smart Quotes minor mode for GNU Emacs                                  |
| uzumaki                      | [[https://github.com/geyslan/uzumaki][geyslan/uzumaki]]                         | A simple buffer cycler                                                 |
| review                       | [[https://github.com/gigamonkey/review][gigamonkey/review]]                       | Commands for inserting review comments                                 |
| org-nan                      | [[https://github.com/gkappler/org-nan][gkappler/org-nan]]                        | Narrowing to multiple subtrees for Org-mode entries                    |
| uncrustify                   | [[https://github.com/glima/Emacs-uncrustify][glima/Emacs-uncrustify]]                  | Apply uncrustify on buffer region                                      |
| orgrade                      | [[https://github.com/gucong/emacs-orgrade][gucong/emacs-orgrade]]                    | Grade book built upon orgtbl that accelerates input                    |
| smart-todo                   | [[https://github.com/gyordanov/smart-todo.el][gyordanov/smart-todo.el]]                 | Makes it easier to quickly add todos                                   |
| evelnote                     | [[https://github.com/hadashiA/evelnote-for-evernote][hadashiA/evelnote-for-evernote]]          | Sync evernote note with emacs buffer                                   |
| buffer-timer                 | [[https://github.com/hardaker/elisp-buffer-timer][hardaker/elisp-buffer-timer]]             | Track your time based on the buffers you edit                          |
| switch-files                 | [[https://github.com/hardaker/elisp-switch-files][hardaker/elisp-switch-files]]             | Switch between matched pairs of files and follow include directives    |
| cl-merge                     | [[https://github.com/haxney/cl-merge][haxney/cl-merge]]                         | Add a `cl-merge-struct' function                                       |
| ezbl                         | [[https://github.com/haxney/ezbl][haxney/ezbl]]                             | Emacs interface for Uzbl (uzbl.org)                                    |
| mysql                        | [[https://github.com/haxney/mysql][haxney/mysql]]                            | Mysql front-end                                                        |
| ca2+                         | [[https://github.com/hjanetzek/ca2][hjanetzek/ca2]]                           | An improved fork of `company-mode'                                     |
| highrise                     | [[https://github.com/hober/37emacs][hober/37emacs]]                           | Client for 37Signals' Highrise API                                     |
| foursquare                   | [[https://github.com/hober/foursquare-el][hober/foursquare-el]]                     | Foursquare client for Emacs                                            |
| html5-tok                    | [[https://github.com/hober/html5-el][hober/html5-el]]                          | HTML Tokenizer                                                         |
| wordnik                      | [[https://github.com/hober/wordnik-el][hober/wordnik-el]]                        | Client library for the Wordnik API                                     |
| lsdb                         | [[https://github.com/ikazuhiro/lsdb][ikazuhiro/lsdb]]                          | The Lovely Sister Database                                             |
| smartchr                     | [[https://github.com/imakado/emacs-smartchr][imakado/emacs-smartchr]]                  | Emacs version of smartchr.vim                                          |
| wikidot-mode                 | [[https://github.com/infochimps-customers/wikidot-mode][infochimps-customers/wikidot-mode]]       | Major mode for editing documents from Wikidot (http://wikidot.com)     |
| lispy-mnemonic               | [[https://github.com/itsjeyd/lispy-mnemonic][itsjeyd/lispy-mnemonic]]                  | Mnemonic key bindings for Lispy                                        |
| epackage                     | [[https://github.com/jaalto/project--emacs-epackage][jaalto/project--emacs-epackage]]          | Distributed Emacs Lisp Package System (DELPS)                          |
| pry                          | [[https://github.com/jacott/emacs-pry][jacott/emacs-pry]]                        | Interaction with the ruby pry command                                  |
| nimrod-mode                  | [[https://github.com/jameshfisher/nimrod-mode][jameshfisher/nimrod-mode]]                | A major mode for the Nimrod programming language                       |
| vimvars                      | [[https://github.com/jamesyoungman/vimvars][jamesyoungman/vimvars]]                   | Emacs support for VI modelines                                         |
| includeme                    | [[https://github.com/jart/includeme][jart/includeme]]                          | Auto C/C++ '#include' and 'using' in Emacs                             |
| flx-rs                       | [[https://github.com/jcs-elpa/flx-rs][jcs-elpa/flx-rs]]                         | Flx in Rust using dynamic module                                       |
| github-tags                  | [[https://github.com/jcs-elpa/github-tags][jcs-elpa/github-tags]]                    | Retrieve tags information through GitHub API                           |
| flxy                         | [[https://github.com/jcs-legacy/flxy][jcs-legacy/flxy]]                         | Fast, character-based search library in Rust                           |
| fuz-bin                      | [[https://github.com/jcs-legacy/fuz-bin][jcs-legacy/fuz-bin]]                      | Fast and precise fuzzy scoring/matching utils                          |
| sublime-fuzzy                | [[https://github.com/jcs-legacy/sublime-fuzzy][jcs-legacy/sublime-fuzzy]]                | Fuzzy matching algorithm like Sublime Text's string search             |
| muse-blog                    | [[https://github.com/jd/muse-blog.el][jd/muse-blog.el]]                         | Keep and publish a blog                                                |
| qooxdoo                      | [[https://github.com/jdodds/qooxdoo.el][jdodds/qooxdoo.el]]                       | Helper functions for working with qooxdoo                              |
| trelloel                     | [[https://github.com/jdodds/trelloel][jdodds/trelloel]]                         | Communication layer for the Trello API                                 |
| cdmi-mode                    | [[https://github.com/jeastman/cdmi-mode][jeastman/cdmi-mode]]                      | An emacs mode for working with CDMI data                               |
| gdb-bp-session               | [[https://github.com/jglee1027/gdb-bp-session][jglee1027/gdb-bp-session]]                | Save and Restore breakpoints for Emacs gdb                             |
| jda                          | [[https://github.com/jglee1027/jda-minor-mode][jglee1027/jda-minor-mode]]                | Jong-Gyu Development Assistant minor mode for Developers               |
| cdecl                        | [[https://github.com/jhgorrell/cdecl-el][jhgorrell/cdecl-el]]                      | Run cdecl                                                              |
| ultex                        | [[https://github.com/jhpalmieri/ultratex][jhpalmieri/ultratex]]                     | Ultra-TeX mode                                                         |
| egit                         | [[https://github.com/jimhourihan/egit][jimhourihan/egit]]                        | Emacs git commit history interface ala gitk and qgit                   |
| quick-jump                   | [[https://github.com/jixiuf/quick-jump][jixiuf/quick-jump]]                       | Remember current position,and jump back                                |
| comicscript                  | [[https://github.com/jkersey/comicscript][jkersey/comicscript]]                     | A major mode for editing comic script files                            |
| ac-dscanner                  | [[https://github.com/jmaschme/ac-dscanner][jmaschme/ac-dscanner]]                    | Auto Completion source for dscanner for GNU Emacs                      |
| taskpaper                    | [[https://github.com/jonasoberschweiber/taskpaper-el][jonasoberschweiber/taskpaper-el]]         | Taskpaper implementation for Emacs                                     |
| ergore                       | [[https://github.com/jonnay/ergore][jonnay/ergore]]                           | Personal Bitlbee robot and helper                                      |
| clojure-refactoring-mode     | [[https://github.com/joodie/clojure-refactoring][joodie/clojure-refactoring]]              | Minor mode for basic clojure                                           |
| simple-slides                | [[https://github.com/joodie/emacs-simple-slides][joodie/emacs-simple-slides]]              | Show page-break (^L) separated files as slides                         |
| iswitch-menu                 | [[https://github.com/joodie/iswitch-menu][joodie/iswitch-menu]]                     | Use iswitch to access menus                                            |
| slime-complete-locals        | [[https://github.com/joodie/slime-complete-locals][joodie/slime-complete-locals]]            | Complete functions taking locally mentioned symbols into account       |
| simplegv-mode                | [[https://github.com/jordonbiondo/simplegv-mode][jordonbiondo/simplegv-mode]]              | Editing mode of JLSCircuitTester files                                 |
| cheat-fu                     | [[https://github.com/jpablobr/cheat-fu-mode][jpablobr/cheat-fu-mode]]                  | An interface to the cheat-fu service                                   |
| ruby-comint                  | [[https://github.com/jpablobr/ruby-comint.el][jpablobr/ruby-comint.el]]                 | Run a ruby process in a compilation buffer                             |
| flowtimer                    | [[https://github.com/jrockway/time-utils-el][jrockway/time-utils-el]]                  | Let yourself work in sprints                                           |
| hsearch                      | [[https://github.com/jschaf/hsearch][jschaf/hsearch]]                          | A major mode to search Haskell                                         |
| ical-event                   | [[https://github.com/jtatarik/ical-event][jtatarik/ical-event]]                     | ICalendar Event Object                                                 |
| yeoman                       | [[https://github.com/julienXX/yeoman.el][julienXX/yeoman.el]]                      | Interact with Yeoman from Emacs                                        |
| pgrok                        | [[https://github.com/juri/pgrok][juri/pgrok]]                              | Project Grokking for Emacs                                             |
| fuzzy-find-in-project        | [[https://github.com/justinweiss/fuzzy-find-in-project][justinweiss/fuzzy-find-in-project]]       | Emacs binding to the `fuzzy_file_finder' rubygem                       |
| git-undo                     | [[https://github.com/jwiegley/git-undo-el][jwiegley/git-undo-el]]                    | Revert region to most recent Git historical version                    |
| gnus-harvest                 | [[https://github.com/jwiegley/gnus-harvest][jwiegley/gnus-harvest]]                   | Harvest e-mail address from read/written articles                      |
| multiple-line-edit           | [[https://github.com/k-talo/multiple-line-edit.el][k-talo/multiple-line-edit.el]]            | Edit multiple line at a time                                           |
| old-fashioned-undo           | [[https://github.com/k-talo/old-fashioned-undo.el][k-talo/old-fashioned-undo.el]]            | Undo/Redo in very simple, and old fashioned way                        |
| networkmanager               | [[https://github.com/k-ten/networkmanager-el][k-ten/networkmanager-el]]                 | Define hooks which run after changing a status of network              |
| twittering-dframe            | [[https://github.com/k-ten/twittering-dframe][k-ten/twittering-dframe]]                 | Dedicate frame for twittering-mode                                     |
| w3m-https-everywhere         | [[https://github.com/k-ten/w3m-https-everywhere][k-ten/w3m-https-everywhere]]              | Encrypting your communications with a number of major websites         |
| drill-instructor             | [[https://github.com/k1LoW/emacs-drill-instructor][k1LoW/emacs-drill-instructor]]            | Enforce key-bind of Emacs                                              |
| key-cast                     | [[https://github.com/k1LoW/emacs-key-cast][k1LoW/emacs-key-cast]]                    | Key comannd casting interface                                          |
| gnus-est                     | [[https://github.com/kawabata/gnus-est][kawabata/gnus-est]]                       | Search mail with HyperEstraier                                         |
| jaunte                       | [[https://github.com/kawaguchi/jaunte][kawaguchi/jaunte]]                        | Cursor teleportation                                                   |
| goby                         | [[https://github.com/kazu-yamamoto/Goby][kazu-yamamoto/Goby]]                      | WYSIWYG presentation tool                                              |
| 1000-words                   | [[https://github.com/kensanata/1000-words][kensanata/1000-words]]                    | Limit yourself to the most common words while writing                  |
| bidi                         | [[https://github.com/kensanata/emacs-bidi][kensanata/emacs-bidi]]                    | Bidi support for Emacs                                                 |
| erobot                       | [[https://github.com/kensanata/erobot][kensanata/erobot]]                        | Game with elisp functions trying to survive                            |
| eval-sexp-in-comments        | [[https://github.com/kensanata/eval-sexp-in-comments][kensanata/eval-sexp-in-comments]]         | Evaluate sexps in comments                                             |
| htmlr                        | [[https://github.com/kensanata/htmlr][kensanata/htmlr]]                         | HTML rendering in Elisp                                                |
| idle-scroll                  | [[https://github.com/kensanata/idle-scroll][kensanata/idle-scroll]]                   | Scroll down a line when Emacs is idle                                  |
| kdic                         | [[https://github.com/kensanata/kdic][kensanata/kdic]]                          | Practice your Kanji using a dictionary                                 |
| loops                        | [[https://github.com/kensanata/loops][kensanata/loops]]                         | Detect loops in lists                                                  |
| mu                           | [[https://github.com/kensanata/mu][kensanata/mu]]                            | Play on a MUSH or MUD within Emacs                                     |
| really-simple-wiki           | [[https://github.com/kensanata/really-simple-wiki][kensanata/really-simple-wiki]]            | Edit local raw wiki pages                                              |
| sql-transform                | [[https://github.com/kensanata/sql-transform][kensanata/sql-transform]]                 | Transform SQL statements                                               |
| toolbox                      | [[https://github.com/kensanata/toolbox][kensanata/toolbox]]                       | Create simple menus in buffers                                         |
| unparen                      | [[https://github.com/kensanata/unparen][kensanata/unparen]]                       | Show elisp code without parenthesis'                                   |
| wiki                         | [[https://github.com/kensanata/wiki][kensanata/wiki]]                          | Hypertext authoring the WikiWay                                        |
| cppref                       | [[https://github.com/kentaro/emacs-cppref][kentaro/emacs-cppref]]                    | A Simple C++ Reference Viewer                                          |
| ditz                         | [[https://github.com/kentaro/emacs-ditz][kentaro/emacs-ditz]]                      | Emacs interface to Ditz issue tracking system                          |
| org-protocol-github-lines    | [[https://github.com/kidd/org-protocol-github-lines][kidd/org-protocol-github-lines]]          | Open files and lines in emacs from your browser (when on github)       |
| inertial-scroll              | [[https://github.com/kiwanami/emacs-inertial-scroll][kiwanami/emacs-inertial-scroll]]          | Global minor mode for inertial scrolling                               |
| bookem                       | [[https://github.com/kjfletch/bookem-el][kjfletch/bookem-el]]                      | Bookmark system organising bookmarks into groups                       |
| jamar                        | [[https://github.com/kliph/jamar-el][kliph/jamar-el]]                          | What's the math?                                                       |
| auto-complete-golang         | [[https://github.com/koko1000ban/auto-complete-golang][koko1000ban/auto-complete-golang]]        | Auto-complete.el source for golang                                     |
| kindle-mode                  | [[https://github.com/kototama/kindle-mode][kototama/kindle-mode]]                    | A minor mode for the Kindle 'My Clippings.txt' file                    |
| crisp-mode                   | [[https://github.com/krisajenkins/crisp-mode][krisajenkins/crisp-mode]]                 | Major mode for Crisp code                                              |
| terminal-notifier            | [[https://github.com/krismolendyke/terminal-notifier.el][krismolendyke/terminal-notifier.el]]      | OS X Notification Center messages                                      |
| ii-mode                      | [[https://github.com/krl/ii-mode][krl/ii-mode]]                             | Handle files created by irc client ii                                  |
| bookiez                      | [[https://github.com/larsmagne/bookiez.el][larsmagne/bookiez.el]]                    | Managing Books                                                         |
| cddb                         | [[https://github.com/larsmagne/cddb.el][larsmagne/cddb.el]]                       | Cddb interface                                                         |
| dae                          | [[https://github.com/larsmagne/dae.el][larsmagne/dae.el]]                        | Digital Audio Extraction                                               |
| eval-server                  | [[https://github.com/larsmagne/eval-server.el][larsmagne/eval-server.el]]                | A framework for doing client/server things                             |
| imdb                         | [[https://github.com/larsmagne/imdb.el][larsmagne/imdb.el]]                       | Querying the imdb movie database                                       |
| movie                        | [[https://github.com/larsmagne/movie.el][larsmagne/movie.el]]                      | Playing movies                                                         |
| pdfscan                      | [[https://github.com/larsmagne/pdfscan.el][larsmagne/pdfscan.el]]                    | Scanning and cropping                                                  |
| pvr                          | [[https://github.com/larsmagne/pvr.el][larsmagne/pvr.el]]                        | Personal Video Recorder                                                |
| scan                         | [[https://github.com/larsmagne/scan.el][larsmagne/scan.el]]                       | Scanning Sleeves                                                       |
| scrobble                     | [[https://github.com/larsmagne/scrobble.el][larsmagne/scrobble.el]]                   | Interfacing with last.fm                                               |
| sqorm                        | [[https://github.com/larsmagne/sqorm.el][larsmagne/sqorm.el]]                      | An ORM for sqlite3                                                     |
| tellstick                    | [[https://github.com/larsmagne/tellstick.el][larsmagne/tellstick.el]]                  | Controlling tellstick controllers                                      |
| touchgrid                    | [[https://github.com/larsmagne/touchgrid.el][larsmagne/touchgrid.el]]                  | Executing actions based on input events                                |
| explain-pause-mode           | [[https://github.com/lastquestion/explain-pause-mode][lastquestion/explain-pause-mode]]         | Explain emacs pauses                                                   |
| grr                          | [[https://github.com/leathekd/grr.el][leathekd/grr.el]]                         | Simple Growl notifications for Emacs and Mac OS X                      |
| org-helpers                  | [[https://github.com/leoc/org-helpers.el][leoc/org-helpers.el]]                     | Summered for Emacs                                                     |
| docsetutil                   | [[https://github.com/leoliu/docsetutil-el][leoliu/docsetutil-el]]                    | Use Cocoa/iOS documentations in emacs                                  |
| gtags                        | [[https://github.com/leoliu/gtags-el][leoliu/gtags-el]]                         | Gtags facility for Emacs                                               |
| bd-set-mark                  | [[https://github.com/lewang/bd-set-mark][lewang/bd-set-mark]]                      | Allow forward movement in mark-ring                                    |
| delim-pad                    | [[https://github.com/lewang/delim-pad][lewang/delim-pad]]                        | Control space padding around delimiters                                |
| generic-edit-special         | [[https://github.com/lewang/generic-edit-special][lewang/generic-edit-special]]             | Editing submodes html css javascript                                   |
| mru-yank                     | [[https://github.com/lewang/le_emacs_MRU_yank][lewang/le_emacs_MRU_yank]]                | Most Recently Used stacking for kill-ring                              |
| whole-line-funcs             | [[https://github.com/lewang/le_emacs_whole_line_funcs][lewang/le_emacs_whole_line_funcs]]        | Triple-click like line marking functions                               |
| xargs-grep                   | [[https://github.com/lewang/le_emacs_xargs_grep][lewang/le_emacs_xargs_grep]]              | Grep large sets of files by using xargs                                |
| theme-helper                 | [[https://github.com/lewang/theme-helper][lewang/theme-helper]]                     | Create color themes faster                                             |
| try-code                     | [[https://github.com/lewang/try-code][lewang/try-code]]                         | Try out a new idea by commenting out old code                          |
| unique-window-buffers        | [[https://github.com/lewang/unique-window-buffers][lewang/unique-window-buffers]]            | Try to avoid showing same buffer in two windows on the same frame      |
| cygstart                     | [[https://github.com/lieutar/cygstart.el][lieutar/cygstart.el]]                     | Run Windows application associated with a file                         |
| find-git                     | [[https://github.com/lieutar/find-git.el][lieutar/find-git.el]]                     | Git working tree browser                                               |
| framov                       | [[https://github.com/lieutar/framov.el][lieutar/framov.el]]                       | Minor mode and any commands for Emacsen on X-Window System             |
| simo                         | [[https://github.com/lieutar/simo.el][lieutar/simo.el]]                         | Simple image manuplation object                                        |
| yatest                       | [[https://github.com/lieutar/yatest.el][lieutar/yatest.el]]                       | Simple test framework                                                  |
| metapost-mode+               | [[https://github.com/liyu1981/metapost-mode-][liyu1981/metapost-mode-]]                 | Drawing with metapost interactively in Emacs                           |
| lookup                       | [[https://github.com/lookup2/lookup2][lookup2/lookup2]]                         | Search interface to electronic dictionaries                            |
| weather                      | [[https://github.com/mad/weather.el][mad/weather.el]]                          | Retrieve weather                                                       |
| awesome-tab                  | [[https://github.com/manateelazycat/awesome-tab][manateelazycat/awesome-tab]]              | Provide an out of box configuration to use tab in Emacs                |
| blink-search                 | [[https://github.com/manateelazycat/blink-search][manateelazycat/blink-search]]             | Blink search                                                           |
| color-rg                     | [[https://github.com/manateelazycat/color-rg][manateelazycat/color-rg]]                 | Search and refacotry code with rg                                      |
| holo-layer                   | [[https://github.com/manateelazycat/holo-layer][manateelazycat/holo-layer]]               | Holo Layer                                                             |
| lsp-bridge                   | [[https://github.com/manateelazycat/lsp-bridge][manateelazycat/lsp-bridge]]               | LSP bridge                                                             |
| snails                       | [[https://github.com/manateelazycat/snails][manateelazycat/snails]]                   | A modern, easy-to-expand fuzzy search framework                        |
| sort-tab                     | [[https://github.com/manateelazycat/sort-tab][manateelazycat/sort-tab]]                 | Smarter tab solution for Emacs, it sort tab with using frequency       |
| mplayer-mode                 | [[https://github.com/markhepburn/mplayer-mode][markhepburn/mplayer-mode]]                | Control mplayer, facilitating transcription and note-taking            |
| tags-view                    | [[https://github.com/markhepburn/tags-view][markhepburn/tags-view]]                   | Display and navigate tags browsing history                             |
| git-find-file                | [[https://github.com/marktriggs/git-find-file.el][marktriggs/git-find-file.el]]             | Incremental search for files in a git repo                             |
| tbemail                      | [[https://github.com/martinp26/tbemail][martinp26/tbemail]]                       | Provide syntax highlighting for email editing via                      |
| distel                       | [[https://github.com/massemanet/distel][massemanet/distel]]                       | Top-level of distel package, loads all subparts                        |
| esn                          | [[https://github.com/mattfidler/Emacs-Speaks-NONMEM][mattfidler/Emacs-Speaks-NONMEM]]          | Emacs Speaks NONMEM                                                    |
| ac-r                         | [[https://github.com/mattfidler/ac-R][mattfidler/ac-R]]                         | Autocompletion routines for R                                          |
| guess-tex-master             | [[https://github.com/mattfidler/guess-tex-master.el][mattfidler/guess-tex-master.el]]          | Guess LaTeX Master File                                                |
| org-readme                   | [[https://github.com/mattfidler/org-readme][mattfidler/org-readme]]                   | Integrates Readme.org and Commentary/Change-logs                       |
| diff-ediff                   | [[https://github.com/matthewlmcclure/diff-ediff][matthewlmcclure/diff-ediff]]              | Navigate diff files with Ediff                                         |
| etags-update                 | [[https://github.com/mattkeller/etags-update][mattkeller/etags-update]]                 | Update TAGS when saving a file                                         |
| mk-project                   | [[https://github.com/mattkeller/mk-project][mattkeller/mk-project]]                   | Lightweight project handling                                           |
| eproject-peepopen            | [[https://github.com/mbarnett/eproject-peepopen][mbarnett/eproject-peepopen]]              | Graphical file chooser for Emacs on Mac OS X                           |
| seognil                      | [[https://github.com/md11235/seognil][md11235/seognil]]                         | Query words in massaged dictionaries in lingoes format                 |
| el-index                     | [[https://github.com/medikoo/el-index][medikoo/el-index]]                        | Generic index mode for Emacs                                           |
| asciidoc                     | [[https://github.com/metaperl/asciidoc-el][metaperl/asciidoc-el]]                    | Asciidoc text file development support                                 |
| perlmonks                    | [[https://github.com/metaperl/emacs-perlmonks][metaperl/emacs-perlmonks]]                | A simple interface to www.perlmonks.org                                |
| indent-hints-mode            | [[https://github.com/mgalgs/indent-hints-mode][mgalgs/indent-hints-mode]]                | Get some hints about whether your buffer is                            |
| color-dired                  | [[https://github.com/mhayashi1120/Emacs-color-dired][mhayashi1120/Emacs-color-dired]]          | Make colorize dired buffer by modified time                            |
| findwalker                   | [[https://github.com/mhayashi1120/Emacs-findwalker][mhayashi1120/Emacs-findwalker]]           | Find file utilities                                                    |
| gosh-mode                    | [[https://github.com/mhayashi1120/Emacs-gosh-mode][mhayashi1120/Emacs-gosh-mode]]            | Programming language gauche editing tools                              |
| openssl-cipher               | [[https://github.com/mhayashi1120/Emacs-openssl-cipher][mhayashi1120/Emacs-openssl-cipher]]       | Encrypt/Decrypt string with password by openssl                        |
| smart-log                    | [[https://github.com/mhayashi1120/smart-log.el][mhayashi1120/smart-log.el]]               | View log file mode with intepretting miscellaneous time format         |
| buftoggle                    | [[https://github.com/michaelw/buftoggle][michaelw/buftoggle]]                      | Toggles between related buffers and files                              |
| combobulate                  | [[https://github.com/mickeynp/combobulate][mickeynp/combobulate]]                    | Edit and navigate text by syntactic constructs                         |
| mini-popup                   | [[https://github.com/minad/mini-popup][minad/mini-popup]]                        | Show the minibuffer in a popup                                         |
| polyp                        | [[https://github.com/minad/polyp][minad/polyp]]                             | Nested transient menus                                                 |
| uchronia                     | [[https://github.com/minad/uchronia][minad/uchronia]]                          | Uchronia mode                                                          |
| lilypond-hook                | [[https://github.com/mjago/lilypond-hook][mjago/lilypond-hook]]                     | Automatically display and play lilypond Score                          |
| epydoc                       | [[https://github.com/mooz/epydoc][mooz/epydoc]]                             | Pydoc interface for emacs                                              |
| cn-outline                   | [[https://github.com/mori-dev/cn-outline][mori-dev/cn-outline]]                     | Minor mode for column-number-base line folding                         |
| sync-scroll                  | [[https://github.com/mori-dev/sync-scroll][mori-dev/sync-scroll]]                    | Scroll Up and Scroll Down 2 window                                     |
| sysuplist-mode               | [[https://github.com/mrBliss/sysuplist-mode][mrBliss/sysuplist-mode]]                  | Emacs Major mode for Yaourt's update selection                         |
| ert-extras                   | [[https://github.com/mrc/ert-extras][mrc/ert-extras]]                          | Some extensions to ert                                                 |
| noob-arrows-mode             | [[https://github.com/n3mo/noob-arrows-mode.el][n3mo/noob-arrows-mode.el]]                | Noob arrows minor mode                                                 |
| mark-select                  | [[https://github.com/namikister/mark-select][namikister/mark-select]]                  | Mark and select interface                                              |
| transcript                   | [[https://github.com/natfarleydev/transcript-el][natfarleydev/transcript-el]]              | Edit transcripts of sound recordings                                   |
| assert-rtn                   | [[https://github.com/neil-smithline-elisp/assert-rtn][neil-smithline-elisp/assert-rtn]]         | A more functional implementation of `assert'                           |
| defhook                      | [[https://github.com/neil-smithline-elisp/defhook][neil-smithline-elisp/defhook]]            | Declare hook functionality rather dynamically implementing it          |
| org-status                   | [[https://github.com/neil-smithline-elisp/org-status][neil-smithline-elisp/org-status]]         | Tweet using `org-mode's capture functionality                          |
| mv-shell                     | [[https://github.com/nflath/mv-shell][nflath/mv-shell]]                         | Keep buffers in sync with filename throughout 'mv'commands in shell-mo |
| ios-config-mode              | [[https://github.com/nibrahim/IOS-config-mode][nibrahim/IOS-config-mode]]                | Edit Cisco IOS configuration files                                     |
| elpad-client                 | [[https://github.com/nicferrier/elpad-client][nicferrier/elpad-client]]                 | A client for elpad                                                     |
| wikidoc                      | [[https://github.com/nicferrier/elwikidoc][nicferrier/elwikidoc]]                    | Use elisp doc strings to make other documentation                      |
| huskie                       | [[https://github.com/nicferrier/emacs-huskie][nicferrier/emacs-huskie]]                 | Chainsaw powered logging                                               |
| isea                         | [[https://github.com/nicferrier/emacs-isea][nicferrier/emacs-isea]]                   | Interactive server eval at mode, a comint for a daemonized emacs       |
| lisp-editing                 | [[https://github.com/nicferrier/emacs-lisp-editing-tools][nicferrier/emacs-lisp-editing-tools]]     | Lisp editing tools                                                     |
| maildir                      | [[https://github.com/nicferrier/emacs-maildir][nicferrier/emacs-maildir]]                | A full maildir handling tool                                           |
| ngircd                       | [[https://github.com/nicferrier/emacs-ngircd][nicferrier/emacs-ngircd]]                 | Start ngircd servers from emacs                                        |
| package-store                | [[https://github.com/nicferrier/emacs-package-store][nicferrier/emacs-package-store]]          | A package cache                                                        |
| rb                           | [[https://github.com/nicferrier/emacs-rhythmbox][nicferrier/emacs-rhythmbox]]              | Control rhythmbox from emacs                                           |
| sequence                     | [[https://github.com/nicferrier/emacs-sequence][nicferrier/emacs-sequence]]               | Makes sequences of numbers                                             |
| swarmhacker                  | [[https://github.com/nicferrier/emacs-swarmhacker][nicferrier/emacs-swarmhacker]]            | Simple swarm chat                                                      |
| org-email                    | [[https://github.com/nicferrier/org-email][nicferrier/org-email]]                    | Use org for an email database                                          |
| org-presie                   | [[https://github.com/nicferrier/org-presie][nicferrier/org-presie]]                   | Simple presentation with an org file                                   |
| paste                        | [[https://github.com/nicferrier/pasteel][nicferrier/pasteel]]                      | Paste server with elnode                                               |
| phantomjs                    | [[https://github.com/nicferrier/phantomjsel][nicferrier/phantomjsel]]                  | Handle phantomjs                                                       |
| rcirc-robots                 | [[https://github.com/nicferrier/rcirc-robots][nicferrier/rcirc-robots]]                 | Robots based on rcirc irc                                              |
| skinny                       | [[https://github.com/nicferrier/skinny][nicferrier/skinny]]                       | A blog engine with elnode                                              |
| ssl-mode                     | [[https://github.com/npc3/ssl-mode][npc3/ssl-mode]]                           | Emacs Major mode for S/SL files                                        |
| async-eval                   | [[https://github.com/nschum/async-eval.el][nschum/async-eval.el]]                    | Execute Emacs lisp in a separate process                               |
| compile-bookmarks            | [[https://github.com/nschum/compile-bookmarks.el][nschum/compile-bookmarks.el]]             | Bookmarks for compilation commands                                     |
| doc-mode                     | [[https://github.com/nschum/doc-mode][nschum/doc-mode]]                         | Convenient editing of in-code documentation                            |
| echo-pick                    | [[https://github.com/nschum/echo-pick.el][nschum/echo-pick.el]]                     | Filter for echo area status messages                                   |
| elk-test                     | [[https://github.com/nschum/elk-test][nschum/elk-test]]                         | Emacs Lisp testing framework                                           |
| guess-style                  | [[https://github.com/nschum/guess-style][nschum/guess-style]]                      | Automatic setting of code style variables                              |
| recent-addresses             | [[https://github.com/nschum/recent-addresses.el][nschum/recent-addresses.el]]              | Store and recall recently used email addresses                         |
| rotate-text                  | [[https://github.com/nschum/rotate-text.el][nschum/rotate-text.el]]                   | Cycle through words, symbols and patterns                              |
| tempo-snippets               | [[https://github.com/nschum/tempo-snippets.el][nschum/tempo-snippets.el]]                | Visual insertion of tempo templates                                    |
| async-completing-read        | [[https://github.com/oantolin/async-completing-read][oantolin/async-completing-read]]          | An async-capable completing read function                              |
| completing-history           | [[https://github.com/oantolin/completing-history][oantolin/completing-history]]             | Insert history items with completion                                   |
| epithet                      | [[https://github.com/oantolin/epithet][oantolin/epithet]]                        | Rename buffers with descriptive names                                  |
| live-completions             | [[https://github.com/oantolin/live-completions][oantolin/live-completions]]               | Live updating of the *Completions* buffer                              |
| math-delimiters              | [[https://github.com/oantolin/math-delimiters][oantolin/math-delimiters]]                | Insert math delimiters in TeX, LaTeX and Org buffers                   |
| placeholder                  | [[https://github.com/oantolin/placeholder][oantolin/placeholder]]                    | Easy insertion and filling of placeholders in text                     |
| restricto                    | [[https://github.com/oantolin/restricto][oantolin/restricto]]                      | Restrict to current minibuffer completion candidates                   |
| rubyinterpol                 | [[https://github.com/ober/rubyinterpol][ober/rubyinterpol]]                       | Ruby-like String Interpolation for format                              |
| zone-matrix                  | [[https://github.com/ober/zone-matrix][ober/zone-matrix]]                        | The matrix screen saver on Emacs                                       |
| antlr-runtime                | [[https://github.com/olabini/antlr-elisp][olabini/antlr-elisp]]                     | Antlr runtime                                                          |
| symbols-mode                 | [[https://github.com/orontee/symbols-mode][orontee/symbols-mode]]                    | List symbols of object files                                           |
| inf-ruby-bond                | [[https://github.com/pd/inf-ruby-bond][pd/inf-ruby-bond]]                        | Bond autocompletion support for inf-ruby                               |
| swallow-window               | [[https://github.com/pd/swallow-window.el][pd/swallow-window.el]]                    | Grow the current window into the space occupied by neighboring windows |
| show-arglist                 | [[https://github.com/peccu/show-arglist.el][peccu/show-arglist.el]]                   | Showing arglist of function at point                                   |
| save-packages                | [[https://github.com/petere/emacs-save-packages][petere/emacs-save-packages]]              | Save and restore installed packages                                    |
| etexshow                     | [[https://github.com/pgundlach/etexshow][pgundlach/etexshow]]                      | Browser for ConTeXt commands                                           |
| itimer                       | [[https://github.com/pheaver/itimer-el][pheaver/itimer-el]]                       | List and operate on emacs timers                                       |
| etest                        | [[https://github.com/philjackson/etest][philjackson/etest]]                       | Run tests and get back a hierarchical set of results                   |
| mythryl-mode                 | [[https://github.com/phr/mythryl-mode][phr/mythryl-mode]]                        | Major mode for editing Mythryl code                                    |
| pmd                          | [[https://github.com/pmd/pmd-emacs][pmd/pmd-emacs]]                           | Major mode for plugging PMD into Emacs                                 |
| elpaca                       | [[https://github.com/progfolio/elpaca][progfolio/elpaca]]                        | An elisp package manager                                               |
| helm-words                   | [[https://github.com/pronobis/helm-words][pronobis/helm-words]]                     | Helm extension for looking up words in dictionaries and thesauri       |
| yammer                       | [[https://github.com/psanford/emacs-yammer][psanford/emacs-yammer]]                   | Simple tool for accessing yammer.com                                   |
| git-code-review              | [[https://github.com/psanford/git-code-review-el][psanford/git-code-review-el]]             | Code review tool for Emacs                                             |
| h2o                          | [[https://github.com/punchagan/h2o][punchagan/h2o]]                           | Orgmode-formatted READMEs for your ELisp                               |
| org-hyde                     | [[https://github.com/punchagan/org-hyde][punchagan/org-hyde]]                      | Export hyde-ready posts from org-mode entries                          |
| pymacs                       | [[https://github.com/pymacs2/Pymacs][pymacs2/Pymacs]]                          | Interface between Emacs Lisp and Python                                |
| atoctx                       | [[https://github.com/quantumkid/atoctx][quantumkid/atoctx]]                       | Converts some LaTeX syntax to ConTeXt                                  |
| tumblr-mode                  | [[https://github.com/qxj/tumblr-mode][qxj/tumblr-mode]]                         | Major mode for Tumblr                                                  |
| dumbparens                   | [[https://github.com/radian-software/dumbparens][radian-software/dumbparens]]              | Simple paren-matching solution                                         |
| straight                     | [[https://github.com/radian-software/straight.el][radian-software/straight.el]]             | Next-generation package manager                                        |
| emux                         | [[https://github.com/re5et/emux][re5et/emux]]                              | Emacs Lisp Behaviour-Driven Development framework                      |
| edbc                         | [[https://github.com/redraiment/edbc][redraiment/edbc]]                         | Emacs database access technology                                       |
| keats                        | [[https://github.com/rejeep/keats][rejeep/keats]]                            | Keybinding Cheats                                                      |
| auto-mounter                 | [[https://github.com/renard/auto-mount-el][renard/auto-mount-el]]                    | Manage automounts using dbus                                           |
| darken-text                  | [[https://github.com/renard/darken-text][renard/darken-text]]                      | Darken font-faced text in emacs                                        |
| db-sql                       | [[https://github.com/renard/db-sql-el][renard/db-sql-el]]                        | Connect to SQL server using tramp syntax                               |
| dired-sync                   | [[https://github.com/renard/dired-sync][renard/dired-sync]]                       | Sync directories within dired                                          |
| dired-xattr                  | [[https://github.com/renard/dired-xattr][renard/dired-xattr]]                      | Handle MacOSX Finder color label in dired                              |
| git-auto-commit              | [[https://github.com/renard/git-auto-commit][renard/git-auto-commit]]                  | Git auto commit directory                                              |
| gnus-identities              | [[https://github.com/renard/gnus-identities][renard/gnus-identities]]                  | Change identity when composing a message                               |
| indicate-changes             | [[https://github.com/renard/indicate-change][renard/indicate-change]]                  | Indicate buffer modifications in fringe                                |
| indirect-region              | [[https://github.com/renard/indirect-region][renard/indirect-region]]                  | Act like indirect-buffer but for region                                |
| keyboard-converter           | [[https://github.com/renard/keyboard-converter][renard/keyboard-converter]]               | Convert string from keyboard layouts                                   |
| nnir-spotlight               | [[https://github.com/renard/nnir-spotlight][renard/nnir-spotlight]]                   | Use MacOSX sportlight as nnir backend                                  |
| osxpkg                       | [[https://github.com/renard/osxpkg][renard/osxpkg]]                           | Manage Mac OSX packages                                                |
| ssh-config                   | [[https://github.com/renard/ssh-config-el][renard/ssh-config-el]]                    | Manage both ssh and dsh confguration from emacs                        |
| string-template              | [[https://github.com/renard/string-template-el][renard/string-template-el]]               | Support for $-substitution                                             |
| tap-mode                     | [[https://github.com/renormalist/emacs-tap-mode][renormalist/emacs-tap-mode]]              | Major mode for editing .tap-files                                      |
| kappa                        | [[https://github.com/rhz/kappa-emacs][rhz/kappa-emacs]]                         | Major mode for Kappa models                                            |
| mark-forward-sexp            | [[https://github.com/rlister/mark-forward-sexp][rlister/mark-forward-sexp]]               | Mark regions sematically inside balanced expressions                   |
| insert-time                  | [[https://github.com/rmm5t/insert-time.el][rmm5t/insert-time.el]]                    | Insert time and date stamps at point                                   |
| utf8islove                   | [[https://github.com/robsimmons/utf8islove][robsimmons/utf8islove]]                   | Quail package for TeX integration                                      |
| infix                        | [[https://github.com/rspeele/infix-dot-el][rspeele/infix.el]]                        | Infix operators for Emacs Lisp                                         |
| pcb-mode                     | [[https://github.com/rswarbrick/pcb-mode][rswarbrick/pcb-mode]]                     | Major mode providing a pcb mode hook for Emacs                         |
| auto-document                | [[https://github.com/rubikitch/auto-document][rubikitch/auto-document]]                 | Automatic document generator of Emacs Lisp                             |
| codepad                      | [[https://github.com/ruediger/emacs-codepad][ruediger/emacs-codepad]]                  | Emacs integration for codepad.org                                      |
| firefox-remote               | [[https://github.com/ruediger/emacs-firefox-remote][ruediger/emacs-firefox-remote]]           | Support for Firefox' remote debugging protocol ;;                      |
| osm-mode                     | [[https://github.com/ruediger/osm-mode][ruediger/osm-mode]]                       | OpenStreetMap (OSM) support for Emacs                                  |
| inform-mode                  | [[https://github.com/rupertl/inform-mode][rupertl/inform-mode]]                     | Major mode for Inform 6 interactive fiction code                       |
| numwin                       | [[https://github.com/ruricolist/numwin][ruricolist/numwin]]                       | Generalized window numbering for Emacs                                 |
| org-velocity                 | [[https://github.com/ruricolist/org-velocity][ruricolist/org-velocity]]                 | Something like Notational Velocity for Org                             |
| elisp-slime-expand           | [[https://github.com/russell/elisp-slime-expand][russell/elisp-slime-expand]]              | A SLIME inspired expander for macros                                   |
| fullscreen-mode              | [[https://github.com/ryantm/fullscreen-mode][ryantm/fullscreen-mode]]                  | Fullscreen window support for Emacs                                    |
| ogi                          | [[https://github.com/ryuslash/ogi][ryuslash/ogi]]                            | Github issues in org-mode                                              |
| twiki-org                    | [[https://github.com/saintaardvark/twiki-org][saintaardvark/twiki-org]]                 | Major mode for editing twiki documents                                 |
| cheat                        | [[https://github.com/samsonjs/cheat.el][samsonjs/cheat.el]]                       | A handy interface to the command line utility cheat                    |
| sentence-highlight           | [[https://github.com/sbelak/sentence-highlight][sbelak/sentence-highlight]]               | Highlight the current sentence                                         |
| popup+                       | [[https://github.com/scjung/popup-plus][scjung/popup-plus]]                       | Enhancement of `popup.el'                                              |
| linum-relativenumber         | [[https://github.com/scottjad/linum-relativenumber][scottjad/linum-relativenumber]]           | Add relative line numbers to linum                                     |
| icons-in-terminal            | [[https://github.com/sebastiencs/icons-in-terminal][sebastiencs/icons-in-terminal]]           | Use any font without replacing or patching your font                   |
| spinasm-mode                 | [[https://github.com/segoh/spinasm-mode][segoh/spinasm-mode]]                      | Mode for editing SpinAsm code                                          |
| cucumber-i18n                | [[https://github.com/senny/cucumber-i18n.el][senny/cucumber-i18n.el]]                  | Translate i18n keys inside cucumber features                           |
| qa-mode                      | [[https://github.com/senny/qa-mode][senny/qa-mode]]                           | Major mode to edit QA files for SuperMemo                              |
| bbcode                       | [[https://github.com/sensorflo/bbcode][sensorflo/bbcode]]                        | A major-mode for editing bbcode                                        |
| font-lock-ext                | [[https://github.com/sensorflo/font-lock-ext][sensorflo/font-lock-ext]]                 | Extensions to Emacs font-lock.el                                       |
| mks                          | [[https://github.com/sensorflo/mks][sensorflo/mks]]                           | Mks source interface for emacs                                         |
| clang-lookup                 | [[https://github.com/sheijk/clang-lookup][sheijk/clang-lookup]]                     | Goto symbol definition using clang                                     |
| zwiebel                      | [[https://github.com/silentbicycle/zwiebel][silentbicycle/zwiebel]]                   | Work/break interval timer                                              |
| ant-project-mode             | [[https://github.com/skeeto/ant-project-mode][skeeto/ant-project-mode]]                 | Minor mode supporting Apache Ant projects                              |
| latch                        | [[https://github.com/skeeto/elisp-latch][skeeto/elisp-latch]]                      | Promises and latches for Elisp                                         |
| youtube-dl                   | [[https://github.com/skeeto/youtube-dl-emacs][skeeto/youtube-dl-emacs]]                 | Manages a youtube-dl queue                                             |
| opscode-sign                 | [[https://github.com/skeptomai/opscode-emacs-sign][skeptomai/opscode-emacs-sign]]            | Opscode API request signer                                             |
| open-related-file            | [[https://github.com/skirino/open-related-file][skirino/open-related-file]]               | Open file related to the currently-opened file                         |
| google-calendar              | [[https://github.com/slaanesh/Google-Calendar-Elisp][slaanesh/Google-Calendar-Elisp]]          | Google Calender API implementation                                     |
| parfait-mode                 | [[https://github.com/sorellabs/parfait-mode][sorellabs/parfait-mode]]                  | Prettifies your code by removing needless clutter                      |
| ertorrent                    | [[https://github.com/spacebat/ertorrent][spacebat/ertorrent]]                      | An rtorrent xml-rpc interface and ui                                   |
| xrc                          | [[https://github.com/spacebat/xrc][spacebat/xrc]]                            | Syntax sugar and other goodies for working with xml-rpc.el             |
| recipe-mode                  | [[https://github.com/sshelagh/recipe-mode][sshelagh/recipe-mode]]                    | A mode to make writing, finding recipes easy                           |
| remind-conf-mode             | [[https://github.com/sshelagh/remind-conf-mode][sshelagh/remind-conf-mode]]               | A mode to help configure remind                                        |
| sclang                       | [[https://github.com/supercollider/scel][supercollider/scel]]                      | IDE for working with the SuperCollider language                        |
| fs-mode                      | [[https://github.com/suzp1984/fs-mode][suzp1984/fs-mode]]                        | Linux file system menagement                                           |
| pulseaudio                   | [[https://github.com/suzp1984/pulseaudio-mode][suzp1984/pulseaudio-mode]]                | Pulseaudio control panel                                               |
| puppet-pi-mode               | [[https://github.com/t9md/puppet-pi-mode.el][t9md/puppet-pi-mode.el]]                  | Interface to puppet commandline tool pi                                |
| mew-ical                     | [[https://github.com/tagoh/mew-ical][tagoh/mew-ical]]                          | ICalendar support for Mew                                              |
| frame-ctr                    | [[https://github.com/takaxp/frame-ctr][takaxp/frame-ctr]]                        | A tool to control frame size, position, and font size                  |
| inf-php                      | [[https://github.com/taksatou/inf-php][taksatou/inf-php]]                        | Run a php interactive shell in a buffer                                |
| let-recur                    | [[https://github.com/tali713/tail-call][tali713/tail-call]]                       | Simplified implementation of recur                                     |
| bundle                       | [[https://github.com/tarao/bundle-el][tarao/bundle-el]]                         | An el-get wrapper                                                      |
| gaplay                       | [[https://github.com/te223/gaplay-el][te223/gaplay-el]]                         | An audio player for GNU Emacs                                          |
| auto-complete-latex-light    | [[https://github.com/tequilasunset/auto-complete-latex-light][tequilasunset/auto-complete-latex-light]] | An abbreviated version of the auto-complete-latex                      |
| clip2org                     | [[https://github.com/thamer/clip2org][thamer/clip2org]]                         | Convert Kindle's My Clippings.txt into Org                             |
| auto-complete-clang-objc     | [[https://github.com/tharpa/auto-complete-clang-objc][tharpa/auto-complete-clang-objc]]         | Auto Completion source for clang for GNU Emacs                         |
| borg-queen                   | [[https://github.com/thblt/borg-queen][thblt/borg-queen]]                        | Manage, install and upgrade Borg drones                                |
| s3                           | [[https://github.com/thorstadt/s3.el][ryancrum/s3.el]]                          | Interact with Amazon Web Services S3                                   |
| trac-wiki                    | [[https://github.com/tiborsimko/trac-wiki-el][tiborsimko/trac-wiki-el]]                 | Edit trac wiki pages in emacs via XML-RPC                              |
| campfire                     | [[https://github.com/timcharper/campfire-el][timcharper/campfire-el]]                  | An interface to campfire                                               |
| ido-other-window             | [[https://github.com/timcharper/ido-other-window][timcharper/ido-other-window]]             | Invoke ido completion in other window                                  |
| ert-buffer-report            | [[https://github.com/tj64/ert-buffer-report][tj64/ert-buffer-report]]                  | Extensions for ert-buffer.el                                           |
| org-hlc                      | [[https://github.com/tj64/org-hlc][tj64/org-hlc]]                            | Hidden-lines-cookies for folded Org-mode headlines                     |
| org-watchdoc                 | [[https://github.com/tj64/org-watchdoc][tj64/org-watchdoc]]                       | Watchdog for exported Org-mode trees                                   |
| picolisp                     | [[https://github.com/tj64/picolisp-mode][tj64/picolisp-mode]]                      | Major mode to edit picoLisp                                            |
| picolisp-wiki-mode           | [[https://github.com/tj64/picolisp-wiki-mode][tj64/picolisp-wiki-mode]]                 | Emacs Major mode for PicoLisp-Wiki formatted text files                |
| codethumb                    | [[https://github.com/tkf/emacs-codethumb][tkf/emacs-codethumb]]                     | Show code thumbnail                                                    |
| wmctrl                       | [[https://github.com/tkf/emacs-wmctrl][tkf/emacs-wmctrl]]                        | Control X Window Manager from Emacs                                    |
| helm-build-command           | [[https://github.com/tkf/helm-build-command][tkf/helm-build-command]]                  | Helm/anything interface for build commands                             |
| hide-url                     | [[https://github.com/tkf/hide-url.el][tkf/hide-url.el]]                         | Hide annoyingly long URLs                                              |
| ne2wm                        | [[https://github.com/tkf/ne2wm][tkf/ne2wm]]                               | TODO Describe what this package does                                   |
| ant-mode                     | [[https://github.com/tkg/ant-mode][tkg/ant-mode]]                            | Mode for Ant build files                                               |
| stickies                     | [[https://github.com/tkosaka/emacs-lisp-stickies][tkosaka/emacs-lisp-stickies]]             | Stickies                                                               |
| pickel                       | [[https://github.com/tlh/pickel.el][tlh/pickel.el]]                           | Elisp object serialization                                             |
| recs-mode                    | [[https://github.com/tlh/recs-mode.el][tlh/recs-mode.el]]                        | [R]eg[E]xp-based [C]ommand [S]uggestion                                |
| easy-imenu-index-generator   | [[https://github.com/tm8st/emacs-easy-imenu-index-generator][tm8st/emacs-easy-imenu-index-generator]]  | Easy implement imenu-create-index-function                             |
| yafastnav                    | [[https://github.com/tm8st/emacs-yafastnav][tm8st/emacs-yafastnav]]                   | Yet another fastnav                                                    |
| ob-markdown                  | [[https://github.com/tnoda/ob-markdown][tnoda/ob-markdown]]                       | Org-babel functions for markdown evaluation                            |
| griffin                      | [[https://github.com/tokenrove/griffin][tokenrove/griffin]]                       | A static blog generator à la Jekyll                                    |
| fuzzyjump                    | [[https://github.com/tomoya/fuzzyjump.el][tomoya/fuzzyjump.el]]                     | Jump to where you (almost) want                                        |
| html-key-chord-mode          | [[https://github.com/tomoya/html-key-chord-mode][tomoya/html-key-chord-mode]]              | Support html tagging key chord                                         |
| xyzzy                        | [[https://github.com/tomoya/xyzzy.el][tomoya/xyzzy.el]]                         | Can use the function with built-in xyzzy                               |
| xdg-paths                    | [[https://github.com/tomprince/xdg-paths-el][tomprince/xdg-paths-el]]                  | XDG Base Directory Specification paths for emacs                       |
| mew-unread                   | [[https://github.com/tortkis/mew-unread][tortkis/mew-unread]]                      | Folder list mode for mew                                               |
| helm-find-files-in-project   | [[https://github.com/tototoshi/helm-find-files-in-project][tototoshi/helm-find-files-in-project]]    | Find files in project from helm                                        |
| csr-mode                     | [[https://github.com/trailbound/csr-mode][trailbound/csr-mode]]                     | Major mode for editing .csr files                                      |
| dvorak-mode                  | [[https://github.com/traveter/dvorak-mode][traveter/dvorak-mode]]                    | Minor mode for convert qwerty input to dvorak input                    |
| ob-mathematica               | [[https://github.com/tririver/ob-mathematica][tririver/ob-mathematica]]                 | Org-babel functions for Mathematica evaluation                         |
| git-emacs                    | [[https://github.com/tsgates/git-emacs][tsgates/git-emacs]]                       | Yet another git emacs mode for newbies                                 |
| pylookup                     | [[https://github.com/tsgates/pylookup][tsgates/pylookup]]                        | Look up python documents (reference) in Emacs                          |
| emacspeak                    | [[https://github.com/tvraman/emacspeak][tvraman/emacspeak]]                       | The Complete Audio Desktop                                             |
| quickfix-mode                | [[https://github.com/ulises/quickfix-mode][ulises/quickfix-mode]]                    | A mode for quickfixing common programming errors                       |
| rd-mode                      | [[https://github.com/uwabami/rdtool][uwabami/rdtool]]                          | Major mode for RD editing                                              |
| lagn                         | [[https://github.com/vanicat/lagn][vanicat/lagn]]                            | A music player for Emacs that uses xmms2 as its backend                |
| colour-region                | [[https://github.com/vapniks/colour-region][vapniks/colour-region]]                   | Toggle regions of the buffer with different text snippets              |
| erc-babel                    | [[https://github.com/vapniks/erc-babel][vapniks/erc-babel]]                       | Communicate with ERC in different languages using online translation s |
| eviews                       | [[https://github.com/vapniks/eviews-mode][vapniks/eviews-mode]]                     | Major-mode for editing eviews program files                            |
| extract-text                 | [[https://github.com/vapniks/extract-text][vapniks/extract-text]]                    | Functions for extracting/scraping text from buffers                    |
| ido-choose-function          | [[https://github.com/vapniks/ido-choose-function][vapniks/ido-choose-function]]             | Use ido to select functions and (partially) apply arguments            |
| jb-misc-functions            | [[https://github.com/vapniks/jb-misc-functions][vapniks/jb-misc-functions]]               | Miscellaneous functions for keymaps & other things                     |
| keyword-arg-macros           | [[https://github.com/vapniks/keyword-arg-macros][vapniks/keyword-arg-macros]]              | Some macros for extracting keyword args from lists                     |
| lazy-search                  | [[https://github.com/vapniks/lazy-search][vapniks/lazy-search]]                     | Lazy Search                                                            |
| one-key                      | [[https://github.com/vapniks/one-key][vapniks/one-key]]                         | Easy access configurable popup menus to display keybindings and other  |
| show-marks                   | [[https://github.com/vapniks/show-marks][vapniks/show-marks]]                      | Navigate and visualize the mark-ring                                   |
| spss                         | [[https://github.com/vapniks/spss-mode][vapniks/spss-mode]]                       | Major-mode for editing SPSS program files                              |
| i3                           | [[https://github.com/vava/i3-emacs][vava/i3-emacs]]                           | Bindings for i3 WM IPC                                                 |
| package-demo                 | [[https://github.com/vermiculus/package-demo][vermiculus/package-demo]]                 | Scripted emacs sessions                                                |
| ido-better-flex              | [[https://github.com/vic/ido-better-flex][vic/ido-better-flex]]                     | A better flex (fuzzy) algorithm for Ido                                |
| spiral                       | [[https://github.com/volrath/spiral][volrath/spiral]]                          | Clojure IDE based on UNREPL                                            |
| mvc                          | [[https://github.com/wachikun/mvc][wachikun/mvc]]                            | M(eta;ulti;enu) Version Control Interface                              |
| nreplxmp                     | [[https://github.com/wakala/nreplxmp][wakala/nreplxmp]]                         | Lispxmp porting for clojure nrepl                                      |
| moneylog                     | [[https://github.com/watter/moneylog-el][watter/moneylog-el]]                      | Provide a way to enter moneylog logs                                   |
| yql                          | [[https://github.com/wfarr/yql-el][wfarr/yql-el]]                            | Emacs Lisp library for accessing YQL                                   |
| auto-complete-ya-gtags       | [[https://github.com/whitypig/auto-complete-ya-gtags][whitypig/auto-complete-ya-gtags]]         | A source for auto-complete                                             |
| popup-global-mark-ring       | [[https://github.com/whitypig/popup-global-mark-ring][whitypig/popup-global-mark-ring]]         | Jumping Interactively through global mark ring                         |
| qtref                        | [[https://github.com/whitypig/qtref][whitypig/qtref]]                          | An interface with Qt API reference on Emacs                            |
| ya-cppref                    | [[https://github.com/whitypig/ya-cppref][whitypig/ya-cppref]]                      | An interface using w3m with cppreference.com references on Emacs       |
| mail-bug                     | [[https://github.com/xaccrocheur/mail-bug][yPhil-gh/mail-bug]]                       | A purely IMAP based email client for EMACS                             |
| buffer-action                | [[https://github.com/xwl/buffer-action][xwl/buffer-action]]                       | Perform actions(compile/run, etc) in buffer based on mode/filename     |
| chicken-scheme-extras        | [[https://github.com/xwl/chicken-scheme-extras][xwl/chicken-scheme-extras]]               | Non-standard macros and special forms support                          |
| dired-view                   | [[https://github.com/xwl/dired-view][xwl/dired-view]]                          | Dired view mode                                                        |
| easy-todo                    | [[https://github.com/xwl/easy-todo][xwl/easy-todo]]                           | Manage your todos in an extremely easy way!                            |
| finkinfo-mode                | [[https://github.com/xwl/finkinfo-mode][xwl/finkinfo-mode]]                       | Major mode for editing fink info files                                 |
| ga                           | [[https://github.com/xwl/ga][xwl/ga]]                                  | Generic apt alike interfaces for various package management tools      |
| gmail-notifier               | [[https://github.com/xwl/gmail-notifier][xwl/gmail-notifier]]                      | Notify unread gmail on mode line                                       |
| graphviz-dot                 | [[https://github.com/xwl/graphviz-dot][xwl/graphviz-dot]]                        | Major mode for editing graphviz dot files                              |
| less                         | [[https://github.com/xwl/less][xwl/less]]                                | Less style view mode                                                   |
| wubi                         | [[https://github.com/xwl/wubi][xwl/wubi]]                                | Chinese-wubi input method in Emacs                                     |
| accelerate                   | [[https://github.com/yagunov/accelerate.el][yagunov/accelerate.el]]                   | Pump numeric arg for auto-repeated interactive commands                |
| igor-mode                    | [[https://github.com/yamad/igor-mode][yamad/igor-mode]]                         | Major mode for editing Igor Pro procedure files                        |
| manued                       | [[https://github.com/yamauchih/manued][yamauchih/manued]]                        | A minor mode of manued proofreading method                             |
| go-svg                       | [[https://github.com/yhvh/go-svg-mode][yhvh/go-svg-mode]]                        | A go gtp interface with svg image support                              |
| terrible-template            | [[https://github.com/yonkeltron/terrible-template][yonkeltron/terrible-template]]            | Templates that don't suck, just terrible                               |
| tmt-mode                     | [[https://github.com/yoshiki/tmt-mode][yoshiki/tmt-mode]]                        | Major mode for editing Text::MicroTemplate syntax                      |
| tx-mode                      | [[https://github.com/yoshiki/tx-mode][yoshiki/tx-mode]]                         | Major mode for editing Text::Xslate syntax                             |
| helm-google-contacts         | [[https://github.com/yuutayamada/helm-google-contacts][yuutayamada/helm-google-contacts]]        | Search google contacts list by helm                                    |
| node-console                 | [[https://github.com/yuutayamada/node-console][yuutayamada/node-console]]                | Execute javascript by node.js from Emacs                               |
| door-gnus                    | [[https://github.com/yyr/door-gnus][yyr/door-gnus]]                           | Hack to enter, bury, unbury gnus                                       |
| namelist-mode                | [[https://github.com/yyr/namelist-mode][yyr/namelist-mode]]                       | Major Mode for editing f90 namelist files                              |
| monorepo-zenitani            | [[https://github.com/zenitani/elisp][zenitani/elisp]]                          | A monorepo containing unrelated packages                               |
| csp-mode                     | [[https://github.com/zonix/csp-mode][zonix/csp-mode]]                          | Major mode for editing CSP specification in Emacs                      |

** Other Git
:PROPERTIES:
:ID:       1b55899d-76c8-48a1-9a39-94adc009695e
:END:
#+name: missing
#+begin_src emacs-lisp :post addheader('("Package" "Link"),*this*)
  (seq-keep (pcase-lambda (`(,name ,type))
              (and (not (epkg-get-recipe 'melpa  name))
                   (not (epkg-get-recipe 'gnu    name))
                   (not (epkg-get-recipe 'nongnu name))
                   (list name type (epkg-org-link name))))
            (epkgs [name class] [git gitlab codeberg sourcehut gnu nongnu]))
#+end_src
#+results: missing
| Package (20)               | Link      |                                             |
|----------------------------+-----------+---------------------------------------------|
| ebuild-mode                | git       |                                             |
| ee                         | gnu       | [[https://savannah.gnu.org/projects/ee][gnu:ee]]                                      |
| elpa-admin                 | git       |                                             |
| geo                        | sourcehut |                                             |
| goldendict                 | git       | [[https://repo.or.cz/goldendict.el.git]]        |
| gpicker                    | nongnu    | [[https://savannah.nongnu.org/projects/gpicker][nongnu:gpicker]]                              |
| gradle                     | sourcehut | [[https://git.sr.ht/~vhallac/gradle-el][vhallac/gradle-el]]                           |
| lakota-input               | sourcehut | [[https://git.sr.ht/~shoshin/lakota-input.git]] |
| lilypond                   | gnu       | [[https://savannah.gnu.org/projects/lilypond][gnu:lilypond]]                                |
| lua-ts-mode                | sourcehut | [[https://git.sr.ht/~johnmuhl/lua-ts-mode][johnmuhl/lua-ts-mode]]                        |
| mailscripts                | git       |                                             |
| ob-sclang                  | git       | [[https://repo.or.cz/ob-sclang.git]]            |
| org-attach-embedded-images | gitlab    | [[https://gitlab.com/marcowahl/org-attach-embedded-images][marcowahl/org-attach-embedded-images]]        |
| org-link-edit              | git       | [[https://git.kyleam.com/org-link-edit/about]]  |
| piem                       | git       | [[https://git.kyleam.com/piem/about]]           |
| python-pep8                | git       |                                             |
| python-pylint              | git       |                                             |
| rdictcc                    | sourcehut | [[https://git.sr.ht/~tsdh/rdictcc][tsdh/rdictcc]]                                |
| riece                      | nongnu    | [[http://www.nongnu.org/riece][nongnu:riece]]                                |
| swift-playground-mode      | gitlab    | [[https://gitlab.com/michael.sanders/swift-playground-mode][michael.sanders/swift-playground-mode]]       |
